In [ ]:
import numpy as np   # import numpy library
import pandas as pd    # import pandas library

In [18]:
import numpy as np  
import pandas as pd  
l=[1,2,3,4]        # Series --->> rows 

s=pd.Series(l)  #case sensitive-->>write Series 1st letter capital
print(s)   # pd.Series >>print the list to rows, where index number is default

0    1
1    2
2    3
3    4
dtype: int64

In [24]:
type(s)

pandas.core.frame.DataFrame

In [22]:

import numpy as np  
import pandas as pd  
l=[1,2,3,4]
s=pd.DataFrame(l)  # DataFrame >>columns  ---2D array
print(s)

   0
0  1
1  2
2  3
3  4

In [61]:
import numpy as np 

l=np.array([1,2,3,4])
print(l)

[1 2 3 4]

In [51]:
#1D array
a= {"col1":[1,2,3], "col2":[4,5,6]}
s=pd.Series(a)
print(s)

col1    [1, 2, 3]
col2    [4, 5, 6]
dtype: object

In [63]:
#2D array

a= {"col1":[1,2,3], "col2":[4,5,6]}
s=pd.DataFrame(a)
print(s)

   col1  col2
0     1     4
1     2     5
2     3     6

In [65]:
type(s)

pandas.core.frame.DataFrame

In [67]:
s.shape

(3, 2)

In [75]:
data=[[1,2,3],[4,5,6]]
df=pd.DataFrame(data,columns=["a","b","c"])
df

   a  b  c
0  1  2  3
1  4  5  6

In [87]:
arr_2d=[[1,2,3],[4,5,6]]
df2=pd.DataFrame(arr_2d,index=["a","b"],columns=["s","r","k"])
df2

   s  r  k
a  1  2  3
b  4  5  6

***Pandas***

In [95]:
ddf=pd.DataFrame({"name": ["gane","charn","ia","raju"],"age":[21,18,20,26]})
ddf

    name  age
0   gane   21
1  charn   18
2     ia   20
3   raju   26

In [97]:
ddf.set_index("age")   #replace index numbers  by age

      name
age
21    gane
18   charn
20      ia
26    raju

In [101]:
ddf.reset_index()  #restore the table

   index   name  age
0      0   gane   21
1      1  charn   18
2      2     ia   20
3      3   raju   26

In [128]:
import pandas as pd
import numpy as np

df=pd.DataFrame({"name":["gani","mahi"],"age": [12,24]})
df

   name  age
0  gani   12
1  mahi   24

In [130]:
a=pd.Series([1,2,3])
a

0    1
1    2
2    3
dtype: int64

In [132]:
#pandas has both series and colums in the matrix
#numpy returns array from list

In [146]:
ddf=pd.DataFrame({"name": ["gane","charn","ia","raju"],"age":[21,18,20,26]})
dff1=ddf.drop(index=[3]) # deleting index 3/ 3rd row
dff1

    name  age
0   gane   21
1  charn   18
2     ia   20

>>Sorting values in a datafrmae

In [154]:
#sorting in ascending order
ddf.sort_values(by="age",ascending=True)

    name  age
1  charn   18
2     ia   20
0   gane   21
3   raju   26

In [156]:
#sorting in descending order
ddf.sort_values(by="age",ascending=False)

    name  age
3   raju   26
0   gane   21
2     ia   20
1  charn   18

>>>Concatenation / Combining Dataframes

In [215]:
df1=pd.DataFrame({"city":["pune","hyd","mumbai","delhi"],"age":[21,18,42,43]})
df1

     city  age
0    pune   21
1     hyd   18
2  mumbai   42
3   delhi   43

In [227]:
df2=pd.DataFrame({"city":["PARIS","ASD","NELLOR","VENUS"],"himidity":[92,87,55,70]})
df2

     city  himidity
0   PARIS        92
1     ASD        87
2  NELLOR        55
3   VENUS        70

In [229]:
pd.concat([df1,df2],axis=1) #axis=1 means across the columns (i.e., operate row-wise).

     city  age    city  himidity
0    pune   21   PARIS        92
1     hyd   18     ASD        87
2  mumbai   42  NELLOR        55
3   delhi   43   VENUS        70

In [231]:
pd.concat([df1,df2],axis=0)  # axis=0(column)

     city   age  himidity
0    pune  21.0       NaN
1     hyd  18.0       NaN
2  mumbai  42.0       NaN
3   delhi  43.0       NaN
0   PARIS   NaN      92.0
1     ASD   NaN      87.0
2  NELLOR   NaN      55.0
3   VENUS   NaN      70.0

In [233]:
#left join 
left_df = pd.merge(df1, df2, on="city", how="left")
left_df

     city  age  himidity
0    pune   21       NaN
1     hyd   18       NaN
2  mumbai   42       NaN
3   delhi   43       NaN

In [237]:
#Right join 
right_df=pd.merge(df1,df2, on ="city",how="right")
right_df

     city  age  himidity
0   PARIS  NaN        92
1     ASD  NaN        87
2  NELLOR  NaN        55
3   VENUS  NaN        70

In [252]:
#inner join---common data records
inner_df = pd.merge(df1,df2, on ="city", how="inner")
inner_df

Empty DataFrame
Columns: [city, age, himidity]
Index: []

In [254]:
#outer join--all the records of both dataframes 
outer_df = pd.merge(df1,df2, on ="city", how="outer")
outer_df

     city   age  himidity
0     ASD   NaN      87.0
1  NELLOR   NaN      55.0
2   PARIS   NaN      92.0
3   VENUS   NaN      70.0
4   delhi  43.0       NaN
5     hyd  18.0       NaN
6  mumbai  42.0       NaN
7    pune  21.0       NaN